controllers/SiteController.php

    public function actionDepartments($id = null)
    {
        $postsQuery = Departments::find()->select([
            'tbl_gp_departments.department_id',
            'tbl_gp_departments.department_name'
        ])
            ->where([
                'tbl_gp_audits.hotel_id' => $id,
            ])
            ->join('LEFT JOIN', 'tbl_gp_audits', 'tbl_gp_audits.department_id = tbl_gp_departments.department_id')
            ->orderBy('tbl_gp_departments.department_id DESC');
---
SELECT `tbl_gp_departments`.`department_id`, `tbl_gp_departments`.`department_name` FROM `tbl_gp_departments` LEFT JOIN `tbl_gp_audits` ON tbl_gp_audits.department_id = tbl_gp_departments.department_id WHERE `tbl_gp_audits`.`hotel_id`='81' ORDER BY `tbl_gp_departments`.`department_id` DESC